<img src="../Img/Python_SQL_PI.png" style="width:100%">


<p style="font-size:22px;text-align:center">Семинар 2.1. Учебная база данных</p> 

<a id = Home></a>

21 февраля 2022 года<br>
Поток: ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6(4 подгруппа)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6(3 подгруппа)

24 февраля 2022 года<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6(1 подгруппа)<br>
ПИ20-1, ПИ20-2, ПИ20-3, ПИ20-4, ПИ20-5, ПИ20-6(2 подгруппа)

<img src="../Img/t1.1_student.png" style="width:60%">

```
STUDENT_ID — числовой код, идентифицирующий студента (идентификатор студента),
SURNAME — фамилия студента,
NAME — имя студента,
STIPEND — стипендия, которую получает студент,
KURS — курс, на котором учится студент,
CITY — город, в котором живет студент,
BIRTHDAY — дата рождения студента,
UNIV_ID — идентификатор университета, в котором учится студент.
```

<img src="../Img/t1.2_lecturer.png" style="width:60%">

```
LECTURER_ID — идентификатор преподавателя,
SURNAME — фамилия преподавателя,
NAME — имя преподавателя,
CITY — город, в котором живет преподаватель,
UNIV_ID — идентификатор университета, в котором работает преподаватель
```

<img src="../Img/t1.3_subject.png" style="width:60%">

```
SUBJ_ID — идентификатор предмета обучения,
SUBJ_NAME — наименование предмета обучения,
HOUR — количество часов, отводимых на изучение предмета,
SEMESTER — семестр, в котором изучается данный предмет.
```

<img src="../Img/t1.4_university.png" style="width:60%">

```
UNIV_ID — идентификатор университета,
UNIV_NAME — название университета,
RATING — рейтинг университета,
CITY — город, в котором расположен университет.
```

<img src="../Img/t1.5_exam_marks.png" style="width:60%">

```
EXAM_ID — идентификатор экзамена,
STUDENT_ID — идентификатор студента,
SUBJ_ID — идентификатор предмета обучения,
MARK — экзаменационная оценка,
EXAM_DATE — дата экзамена.
```

<img src="../Img/t1.6_subj_lect.png" style="width:40%">

```
LECTURER_ID — идентификатор преподавателя,
SUBJ_ID — идентификатор предмета обучения.


ВОПРОСЫ
1. Какие поля приведенных таблиц являются первичными ключами?
2. Какие данные хранятся в столбце 2 в таблице “Предмет обучения”?
3. Как по-другому называется строка? столбец?
4. Почему мы не можем запросить для просмотра первые пять строк?


ЗАДАНИЯ, ЧАСТЬ I

1. Создайте на языке Пайтон структуру учебной базы данных студентов Students.db
2. Наполните базыу данных данными

ЗАДАНИЯ, ЧАСТЬ II

Выполните запросы к базе данных студентов.

1. Напишите запрос к таблице SUBJECT, выводящий для каждой ее строки идентификатор (номер) предмета обучения, его наименование, семестр, в котором он читается, и количество отводимых на него часов.
2. Напишите запрос, позволяющий вывести все строки таблицы EXAM_MARKS, в которых предмет обучения имеет номер (SUBJ_ID), равный 22.
3. Напишите запрос, выбирающий все данные из таблицы STUDENT, расположив столбцы таблицы в следующем порядке: KURS, SURNAME, NAME, STIPEND.
4. Напишите запрос SELECT, который для каждого предмета обучения (SUBJECT) выполняет вывод его наименования (SUBJ_NAME) и следом за ним количества часов (HOUR) в 4-м семестре (SEMESTR).
5. Напишите запрос, позволяющий получить из таблицы EXAM_MARKS значения столбца MARK (экзаменационная оценка) для всех студентов, исключив из списка повторение одинаковых строк.
6. Напишите запрос, который выполняет вывод списка фамилий студентов, обучающихся на третьем и более старших курсах.
7. Напишите запрос, выбирающий данные фамилию, имя и номер курса для студентов, получающих стипендию больше 140.
8. Напишите запрос, выполняющий выборку из таблицы SUBJECT названий всех предметов обучения, на которые отводится более 30 часов.
9. Напишите запрос, который выполняет вывод списка университетов, рейтинг которых превышает 300 баллов.
10. Напишите запрос к таблице STUDENT для вывода списка всех студентов со стипендией не меньше 100, живущих в Воронеже — с указанием фамилии (SURNAME), имени (NAME) и номера курса (KURS).
11. Какие данные будут получены в результате выполнения запроса?

SELECT *
FROM STUDENT
WHERE (STIPEND < 100 OR
NOT (BIRTHDAY >= ‘10/03/1980’
AND STUDENT_ID > 1003));

12. Какие данные будут получены в результате выполнения запроса?

SELECT *
FROM STUDENT
WHERE NOT ((BIRTHDAY = ‘10/03/1980’ OR
STIPEND > 100)
AND STUDENT_ID >= 1003);

13. Напишите запрос для получения списка студентов старше 25 лет, обучающихся на 1-м курсе.
14. Напишите запрос для получения списка предметов, для которых в 1-м семестре отведено более 100 часов.
15. Напишите запрос для получения списка преподавателей, живущих в Воронеже.
16. Напишите запрос для получения списка университетов, расположенных в Москве и имеющих рейтинг меньший, чем у ВГУ. Константу в ограничении на рейтинг можно определить по этой же таблице.
17. Напишите запрос для получения списка студентов, проживающих в Воронеже и не получающих стипендию.
18. Напишите запрос для получения списка студентов моложе 20 лет.
```

# Решение, часть 1.

In [1]:
import sqlite3

In [2]:
conn=sqlite3.connect("L21_Solution.db")
crs=conn.cursor()

In [3]:
#  Создадим sql-выражения

create_student = """
CREATE TABLE IF NOT EXISTS student (
  STUDENT_ID integer PRIMARY KEY,
  SURNAME text NOT NULL,
  NAME text NOT NULL,
  STIPEND integer NOT NULL, 
  KURS text NOT NULL,
  CITY text,
  BIRTHDAY text,
  UNIV_ID integer NOT NULL,
  FOREIGN KEY (UNIV_ID) REFERENCES university (UNIV_ID)
);
"""

create_university = """
CREATE TABLE IF NOT EXISTS university (
  UNIV_ID integer PRIMARY KEY,
  UNIV_NAME text NOT NULL,
  RATING integer NOT NULL,
  CITY text NOT NULL
);
"""

create_lecturer = """
CREATE TABLE IF NOT EXISTS lecturer (
  LECTURER_ID integer PRIMARY KEY,
  SURNAME text NOT NULL,
  NAME text NOT NULL,
  CITY text NOT NULL,
  UNIV_ID integer NOT NULL,
  FOREIGN KEY (UNIV_ID) REFERENCES university (UNIV_ID)
);
"""

create_subject = """
CREATE TABLE IF NOT EXISTS subject (
  SUBJ_ID integer PRIMARY KEY,
  SUBJ_NAME text NOT NULL,
  HOUR integer NOT NULL,
  SEMESTER integer NOT NULL
);
"""

create_exam_marks = """
CREATE TABLE IF NOT EXISTS exam_marks (
  EXAM_ID integer PRIMARY KEY,
  STUDENT_ID integer NOT NULL,
  SUBJ_ID integer NOT NULL,
  MARK integer,
  EXAM_DATE text NOT NULL,
  FOREIGN KEY (STUDENT_ID) REFERENCES student (STUDENT_ID),
  FOREIGN KEY (SUBJ_ID) REFERENCES subject (SUBJ_ID)
);
"""

create_subj_lect = """
CREATE TABLE IF NOT EXISTS subj_lect (
  LECTURER_ID integer NOT NULL,
  SUBJ_ID integer NOT NULL,
  PRIMARY KEY (LECTURER_ID, SUBJ_ID),
  FOREIGN KEY (SUBJ_ID) REFERENCES subject (SUBJ_ID),
  FOREIGN KEY (LECTURER_ID) REFERENCES lecture (LECTURER_ID)
);
"""

In [4]:
all_tables = [create_student, create_lecturer, create_subject, 
              create_university, create_exam_marks, create_subj_lect]
for t in all_tables:
    crs.execute(t)

In [5]:
# Чтобы добавить несколько строк данных в таблицу, используем метод cursor.executemany()

def insert_record(table, columns, values):
  if len(columns) ==  2:
    crs.executemany(f"INSERT INTO {table} VALUES (?, ?);", values)
  if len(columns) ==  4:
    crs.executemany(f"INSERT INTO {table} VALUES (?, ?, ?, ?);", values)
  if len(columns) ==  5:
    crs.executemany(f"INSERT INTO {table} VALUES (?, ?, ?, ?, ?);", values)
  if len(columns) ==  8:
    crs.executemany(f"INSERT INTO {table} VALUES (?, ?, ?, ?, ?, ?, ?, ?);", values)

In [6]:
insert_record('subj_lect', ['lecturer_id', 'subj_id'], 
              [('24', '24'), ('46', '46'), ('74','74'), 
               ('108', '108'), ('276', '276'), ('328', '328')])

insert_record('university', ['univ_id', 'univ_name', 'rating', 'city'], 
              [("22", "МГУ", "610", "Москва"), ("10", "ВГУ", "296", "Воронеж"), 
               ("11", "НГУ", "345", "Новосибирск"), ("32", "РГУ", "421", "Ростов"), 
               ("14", "БГУ", "326", "Белгород"), ("15", "ТГУ", "373", "Томск"), 
               ("18", "ВГМА", "327", "Воронеж")])

insert_record('lecturer', ['lecturer_id', 'surname', 'name', 'city', 'univ_id'], 
              [('24', 'Колесников', 'Борис', 'Воронеж', '10'), 
               ('46', 'Никонов', 'Иван', 'Воронеж', '10'), 
               ('74', 'Лагутин', 'Павел', 'Москва', '22'), 
               ('108', 'Струков', 'Николай', 'Москва', '22'), 
               ('276', 'Николаев', 'Виктор', 'Воронеж', '10'), 
               ('328', 'Сорокин', 'Андрей', 'Орел', '10')])

insert_record('student', 
              ['student_id', 'surname', 'name', 'stipend', 'kurs', 'city', 'birthday', 'univ_id'], 
              [('1', 'Иванов', 'Иван', '150', '1', 'Орел', '1988-12-03', '10'), 
               ('3', 'Петров', 'Петр', '200', '3', 'Курск', '1986-12-11', '10'), 
               ('6', 'Сидоров', 'Вадим', '150', '4', 'Москва', '1985-06-07', '22'), 
               ('10', 'Кузнецов', 'Борис', '0', '2', 'Брянск', '1987-12-08', '10'), 
               ('12', 'Зайцева', 'Ольга', '250', '2', 'Липецк', '1987-05-21', '10'), 
               ('265', 'Павлов', 'Андрей', '0', '3', 'Воронеж', '1985-11-05', '10'), 
               ('32', 'Котов', 'Павел', '150', '5', 'Белгород', None, '14'), 
               ('654', 'Лукин', 'Артем', '200', '3', 'Воронеж', '1987-12-11', '10'), 
               ('276', 'Петров', 'Антон', '200', '4', None, '1987-08-05', '22'), 
               ('55', 'Белкин', 'Вадим', '250', '5', 'Воронеж', '1986-01-20', '10')])

insert_record('exam_marks', ['exam_id', 'stident_id', 'subj_id', 'mark', 'exam_date'], 
              [('145', '12', '10', '5', '2006-01-12'), ('34', '32', '10', '4', '2006-01-23'), 
               ('75', '55', '10', '5', '2006-01-05'), ('238', '12', '22', '3', '2005-06-17'), 
               ('639', '55', '22', None, '2005-06-22'), ('43', '6', '22', '4', '2006-01-18')])

insert_record('subject', ['subj_id', 'subj_name', 'hour', 'semester'], 
              [('10', 'Информатика', '56', '1'), ('22', 'Физика', '34', '1'), 
               ('43', 'Математика', '56', '2'), ('56', 'История', '34', '4'), 
               ('94', 'Английский', '56', '3'), ('73', 'Физкультура', '34', '5')])

conn.commit()

# Решение, часть II

In [14]:
import pandas as pd
from datetime import datetime

In [8]:
# 1
crs.execute('SELECT * FROM subject;')
rows = crs.fetchall()
rows

[(10, 'Информатика', 56, 1),
 (22, 'Физика', 34, 1),
 (43, 'Математика', 56, 2),
 (56, 'История', 34, 4),
 (73, 'Физкультура', 34, 5),
 (94, 'Английский', 56, 3)]

In [12]:
#2
stmt='SELECT * FROM exam_marks where subj_id=22;'
rows = crs.fetchall()
df=pd.read_sql(stmt,conn)
df

   EXAM_ID  STUDENT_ID  SUBJ_ID  MARK   EXAM_DATE
0       43           6       22   4.0  2006-01-18
1      238          12       22   3.0  2005-06-17
2      639          55       22   NaN  2005-06-22